alplabai/gd32-bridge-firmware/tests/unit/adc_seq/src/test_adc_seq.c
/* ---------------------------------------------------------------------
 * #44 test 2 -- a live ROVF makes bridge_hw_adc_stream_read report
 * BRIDGE_HW_ERR_BUSY (never a silent zero-sample STATUS_OK).
 * --------------------------------------------------------------------- */

ZTEST(gd32_adc_seq, test_stream_read_reports_busy_on_rovf)
{
	adc_seq_reset();

	int rc = bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u);
	zassert_equal(rc, BRIDGE_HW_OK, "stream_begin succeeds against the mock");

	/* Drive the mocked overflow flag exactly as #44 describes: an
	 * overflow occurred mid-stream. */
	mock_adc_set_flag(BRIDGE_ADC_CH0_PERIPH, ADC_FLAG_ROVF, SET);

	uint8_t  got = 0xFFu;
	uint16_t mv[4];
	rc = bridge_hw_adc_stream_read(0u, 4u, &got, mv);

	zassert_equal(rc,
	              BRIDGE_HW_ERR_BUSY,
	              "a live ROVF must answer BUSY, never silent STATUS_OK/zero-samples");
	zassert_equal(got, 0u, "no samples are served from an overflowed ring");
	zassert_equal((int)adc_flag_get(BRIDGE_ADC_CH0_PERIPH, ADC_FLAG_ROVF),
	              (int)RESET,
	              "recovery must clear ROVF");
}

/* ---------------------------------------------------------------------
 * ROVF recovery must clear the DMA FTF interrupt flag (this PR's fix).
 * --------------------------------------------------------------------- */

ZTEST(gd32_adc_seq, test_rovf_recovery_clears_dma_ftf)
{
	adc_seq_reset();

	int rc = bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u);
	zassert_equal(rc, BRIDGE_HW_OK, "stream_begin succeeds against the mock");

	mock_adc_set_flag(BRIDGE_ADC_CH0_PERIPH, ADC_FLAG_ROVF, SET);

	uint8_t  got = 0xFFu;
	uint16_t mv[4];
	rc = bridge_hw_adc_stream_read(0u, 4u, &got, mv);
	zassert_equal(rc, BRIDGE_HW_ERR_BUSY, "ROVF recovery path taken");

	/* DMA0 is stream 0's controller (stream_begin: s->dma_periph =
	 * (stream_id == 0u) ? DMA0 : DMA1). */
	int ftf_clear_i = mock_seq_find_from("dma_interrupt_flag_clear", DMA0, 0);
	zassert_true(ftf_clear_i >= 0,
	             "ROVF recovery must clear the DMA FTF interrupt flag, "
	             "or a pending lap tick fires the instant this handler "
	             "returns and corrupts the freshly-resynced lap_count");
}

/* ---------------------------------------------------------------------
 * #140 -- ending and rebinding an FFT stream starts a new publication
 * session. Until that session fills and publishes its own FFT window,
 * spectrum_read must answer IO/BUSY instead of reporting the prior sequence
 * as a successful empty frame.
 * --------------------------------------------------------------------- */

static void bind_test_fft_chain(uint8_t stream_id)
{
	adc_dsp_chain_t *chain = &adc_dsp_chains[0];
	memset(chain, 0, sizeof(*chain));
	chain->in_use = true;

	adc_dsp_stage_t *fft = &chain->stages[0];
	fft->kind            = 3u;
	fft->total_size      = BRIDGE_DSP_STAGE_HDR_BYTES;
	fft->bytes_received  = BRIDGE_DSP_STAGE_HDR_BYTES;
	fft->complete        = true;
	fft->data[0]         = 32u; /* 32-point FFT, little-endian u16 */
	fft->data[1]         = 0u;
	fft->data[2]         = 0u; /* complex output */
	fft->data[3]         = 0u;

	zassert_equal(bridge_hw_adc_dsp_chain_bind(0u, stream_id),
	              BRIDGE_HW_OK,
	              "well-formed test FFT chain binds");
}

static void bind_test_fir_chain(uint8_t stream_id)
{
	adc_dsp_chain_t *chain = &adc_dsp_chains[0];
	memset(chain, 0, sizeof(*chain));
	chain->in_use = true;

	adc_dsp_stage_t *fir = &chain->stages[0];
	fir->kind            = 0u;
	fir->total_size      = BRIDGE_DSP_STAGE_HDR_BYTES + 4u;
	fir->bytes_received  = fir->total_size;
	fir->complete        = true;
	fir->data[0]         = 1u;    /* Q31 */
	fir->data[1]         = 1u;    /* one tap */
	fir->data[7]         = 0x40u; /* 0.5 in little-endian Q31 */

	zassert_equal(bridge_hw_adc_dsp_chain_bind(0u, stream_id),
	              BRIDGE_HW_OK,
	              "well-formed test FIR chain binds");
}

static int fft_init_end_result;
static int fac_init_end_result;
static int replacement_end_result;
static int replacement_begin_result;

static void end_stream_during_fft_init(void)
{
	fft_init_end_result = bridge_hw_adc_stream_end(0u);
}

static void end_stream_during_fac_init(void)
{
	fac_init_end_result = bridge_hw_adc_stream_end(0u);
}

static void replace_stream_with_fft(void)
{
	replacement_end_result   = bridge_hw_adc_stream_end(0u);
	replacement_begin_result = bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u);
	if (replacement_begin_result != BRIDGE_HW_OK) return;
	bind_test_fft_chain(0u);
	for (uint16_t i = 0u; i < 32u; ++i)
		adc_streams[0].ring[i] = (uint16_t)(100u + i);
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 32u);
	mock_fft_set_flag(SET);
}

static void replace_stream_with_fir(void)
{
	replacement_end_result   = bridge_hw_adc_stream_end(0u);
	replacement_begin_result = bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u);
	if (replacement_begin_result != BRIDGE_HW_OK) return;
	bind_test_fir_chain(0u);
	adc_streams[0].ring[0] = 1024u;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 1u);
}

ZTEST(gd32_adc_seq, test_fft_rebind_rejects_previous_sequence_until_new_frame)
{
	adc_seq_reset();

	/* Session 1 publishes one real frame through the production pump. */
	zassert_equal(
	    bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u), BRIDGE_HW_OK, "first stream begins");
	bind_test_fft_chain(0u);
	for (uint16_t i = 0u; i < 32u; ++i)
		adc_streams[0].ring[i] = i;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 32u);
	mock_fft_set_flag(SET);
	bridge_hw_dsp_pump();

	uint32_t seq   = 0u;
	uint16_t total = 0u;
	uint8_t  got   = 0u;
	float    bin   = -1.0f;
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_OK,
	              "first session publishes a readable frame");
	zassert_equal(seq, 1u, "first session frame sequence starts at one");
	zassert_equal(got, 1u, "one complex-output bin component is returned");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "first stream ends cleanly");

	/* Session 2 has configured the FFT owner but produced no samples. The
	 * old frame must remain hidden until this session publishes its own. */
	zassert_equal(bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u),
	              BRIDGE_HW_OK,
	              "second stream begins");
	bind_test_fft_chain(0u);
	mock_fft_set_flag(RESET);
	bridge_hw_dsp_pump();

	seq   = 0xDEADBEEFu;
	total = 0xFFFFu;
	got   = 0xFFu;
	bin   = -1.0f;
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_ERR_IO,
	              "freshly rebound FFT session has no frame yet");
	zassert_equal(got, 0u, "no bins are reported before this session publishes");

	for (uint16_t i = 0u; i < 32u; ++i)
		adc_streams[0].ring[i] = (uint16_t)(32u - i);
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 32u);
	mock_fft_set_flag(SET);
	bridge_hw_dsp_pump();
	seq   = 0u;
	total = 0u;
	got   = 0u;
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_OK,
	              "second session publishes its own readable frame");
	zassert_equal(seq, 1u, "new session frame sequence restarts at one");
	zassert_equal(got, 1u, "new session serves its own bin data");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "second stream ends cleanly");
}

ZTEST(gd32_adc_seq, test_fft_config_preemption_cannot_resurrect_ended_stream)
{
	adc_seq_reset();
	fft_init_end_result = BRIDGE_HW_ERR_IO;

	/* Give the first pump enough data to publish, then model the transport
	 * ISR ending the stream from inside the long first-time FFT config. */
	zassert_equal(
	    bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u), BRIDGE_HW_OK, "stream begins");
	bind_test_fft_chain(0u);
	for (uint16_t i = 0u; i < 32u; ++i)
		adc_streams[0].ring[i] = i;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 32u);
	mock_fft_set_flag(SET);
	mock_fft_set_init_hook(end_stream_during_fft_init);
	bridge_hw_dsp_pump();

	zassert_equal(fft_init_end_result, BRIDGE_HW_OK, "ISR-side stream end succeeds");
	zassert_false(adc_streams[0].in_use, "interrupted session remains ended");

	/* A fresh same-ID session must not inherit the owner or a frame that
	 * base level could otherwise have published after the teardown. */
	zassert_equal(bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u),
	              BRIDGE_HW_OK,
	              "replacement stream begins");
	bind_test_fft_chain(0u);
	bridge_hw_dsp_pump();

