alplabai/gd32-bridge-firmware/tests/unit/adc_seq/src/test_adc_seq.c
	uint32_t seq   = 0u;
	uint16_t total = 0u;
	uint8_t  got   = 0u;
	float    bin   = -1.0f;
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_ERR_IO,
	              "replacement session has no frame before its own samples");
	zassert_equal(got, 0u, "replacement session reports no bins before publication");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "replacement stream ends cleanly");
}

ZTEST(gd32_adc_seq, test_fac_config_preemption_cannot_resurrect_ended_stream)
{
	adc_seq_reset();
	fac_init_end_result = BRIDGE_HW_ERR_IO;

	/* End the session from the transport-ISR seam inside FAC setup. The
	 * configuring token must let release see the in-progress owner. */
	zassert_equal(
	    bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u), BRIDGE_HW_OK, "stream begins");
	bind_test_fir_chain(0u);
	adc_streams[0].ring[0] = 2048u;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 1u);
	mock_fac_set_init_hook(end_stream_during_fac_init);
	bridge_hw_dsp_pump();

	zassert_equal(fac_init_end_result, BRIDGE_HW_OK, "ISR-side stream end succeeds");
	zassert_false(adc_streams[0].in_use, "interrupted FAC session remains ended");
	zassert_equal(adc_streams[0].proc_write, 0u, "ended session publishes no filtered sample");
	int first_stop = mock_seq_find_from("fac_stop", 0u, 0);
	int restart    = mock_seq_find_from("fac_start", 0u, first_stop + 1);
	int final_stop = mock_seq_find_from("fac_stop", 0u, restart + 1);
	zassert_true(first_stop >= 0, "release stops the configuring FAC owner");
	zassert_true(restart > first_stop, "interrupted config resumes and starts FAC once");
	zassert_true(final_stop > restart, "failed ownership commit stops FAC again");

	/* Reusing the stream ID must perform a fresh configuration and process
	 * new data instead of inheriting the ended session's FAC owner. */
	zassert_equal(bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u),
	              BRIDGE_HW_OK,
	              "replacement stream begins");
	bind_test_fir_chain(0u);
	adc_streams[0].ring[0] = 1024u;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 1u);
	const int before_replacement_pump = mock_seq_n;
	bridge_hw_dsp_pump();
	zassert_true(mock_seq_find_from("fac_init", 0u, before_replacement_pump) >= 0,
	             "replacement session configures FAC again");
	zassert_equal(adc_streams[0].proc_write, 1u, "replacement session processes its own sample");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "replacement stream ends cleanly");
}

ZTEST(gd32_adc_seq, test_fac_post_commit_preemption_cannot_drain_replacement)
{
	adc_seq_reset();
	replacement_end_result   = BRIDGE_HW_ERR_IO;
	replacement_begin_result = BRIDGE_HW_ERR_IO;

	zassert_equal(
	    bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u), BRIDGE_HW_OK, "stream begins");
	bind_test_fir_chain(0u);
	adc_streams[0].ring[0] = 2048u;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 1u);

	/* dma_transfer_number_get() is the first interruptible call after the
	 * configuring token has committed to an active FAC owner. Replace the
	 * same stream ID there, then return the old DMA snapshot to the suspended
	 * pump: without a guarded FAC transaction it drains replacement data
	 * through the previous session's configuration. */
	const int before_stale_pump = mock_seq_n;
	mock_dma_set_transfer_get_hook(replace_stream_with_fir);
	bridge_hw_dsp_pump();

	zassert_equal(replacement_end_result, BRIDGE_HW_OK, "post-commit END succeeds");
	zassert_equal(replacement_begin_result, BRIDGE_HW_OK, "same-ID replacement begins");
	zassert_equal(adc_streams[0].proc_write, 0u, "suspended pump publishes no replacement sample");
	zassert_true(mock_seq_find_from("fac_fixed_data_write", 0u, before_stale_pump) < 0,
	             "revoked FAC owner performs no post-END MMIO");

	const int before_replacement_pump = mock_seq_n;
	bridge_hw_dsp_pump();
	zassert_true(mock_seq_find_from("fac_init", 0u, before_replacement_pump) >= 0,
	             "next main-loop pump configures the replacement FAC session");
	zassert_true(mock_seq_find_from("fac_fixed_data_write", 0u, before_replacement_pump) >= 0,
	             "replacement session processes its own sample");
	zassert_equal(adc_streams[0].proc_write, 1u, "replacement publishes exactly one sample");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "replacement stream ends cleanly");
}

ZTEST(gd32_adc_seq, test_fft_post_commit_preemption_cannot_drain_replacement)
{
	adc_seq_reset();
	replacement_end_result   = BRIDGE_HW_ERR_IO;
	replacement_begin_result = BRIDGE_HW_ERR_IO;

	zassert_equal(
	    bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u), BRIDGE_HW_OK, "stream begins");
	bind_test_fft_chain(0u);
	for (uint16_t i = 0u; i < 32u; ++i)
		adc_streams[0].ring[i] = i;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 32u);
	mock_fft_set_flag(SET);

	const int before_stale_pump = mock_seq_n;
	mock_dma_set_transfer_get_hook(replace_stream_with_fft);
	bridge_hw_dsp_pump();

	zassert_equal(replacement_end_result, BRIDGE_HW_OK, "post-commit END succeeds");
	zassert_equal(replacement_begin_result, BRIDGE_HW_OK, "same-ID replacement begins");
	zassert_equal(
	    adc_streams[0].pump_raw_read, 0u, "suspended pump consumes no replacement samples");
	zassert_true(mock_seq_find_from("fft_calculation_start", 0u, before_stale_pump) < 0,
	             "revoked FFT owner cannot start a replacement frame");

	const int before_replacement_pump = mock_seq_n;
	bridge_hw_dsp_pump();
	zassert_true(mock_seq_find_from("fft_calculation_start", 0u, before_replacement_pump) >= 0,
	             "next main-loop pump calculates the replacement frame");
	uint32_t seq   = 0u;
	uint16_t total = 0u;
	uint8_t  got   = 0u;
	float    bin   = -1.0f;
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_OK,
	              "replacement publishes its own frame");
	zassert_equal(seq, 1u, "replacement frame sequence starts at one");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "replacement stream ends cleanly");
}

