alplabai/gd32-bridge-firmware/tests/unit/adc_seq/src/test_adc_seq.c
ZTEST(gd32_adc_seq, test_fft_wait_preemption_cannot_publish_ended_session)
{
	adc_seq_reset();
	replacement_end_result   = BRIDGE_HW_ERR_IO;
	replacement_begin_result = BRIDGE_HW_ERR_IO;

	zassert_equal(
	    bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u), BRIDGE_HW_OK, "stream begins");
	bind_test_fft_chain(0u);
	/* First tick establishes the active FFT owner without a frame. */
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES);
	bridge_hw_dsp_pump();

	for (uint16_t i = 0u; i < 32u; ++i)
		adc_streams[0].ring[i] = i;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 32u);
	mock_fft_set_flag(SET);
	mock_fft_set_poll_hook(replace_stream_with_fft);
	bridge_hw_dsp_pump();

	zassert_equal(replacement_end_result, BRIDGE_HW_OK, "END during FFT wait succeeds");
	zassert_equal(replacement_begin_result, BRIDGE_HW_OK, "replacement begins during FFT wait");
	uint32_t seq   = 0xDEADBEEFu;
	uint16_t total = 0xFFFFu;
	uint8_t  got   = 0xFFu;
	float    bin   = -1.0f;
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_ERR_IO,
	              "ended session's completed hardware result remains unpublished");
	zassert_equal(got, 0u, "no stale bins are exposed");

	bridge_hw_dsp_pump();
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_OK,
	              "replacement can publish its own frame on the next tick");
	zassert_equal(seq, 1u, "replacement publication starts a fresh sequence");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "replacement stream ends cleanly");
}

ZTEST(gd32_adc_seq, test_fft_publish_commit_preemption_cannot_expose_stale_frame)
{
	adc_seq_reset();
	replacement_end_result   = BRIDGE_HW_ERR_IO;
	replacement_begin_result = BRIDGE_HW_ERR_IO;

	zassert_equal(
	    bridge_hw_adc_stream_begin(0u, BRIDGE_ADC_CH0, 1000u), BRIDGE_HW_OK, "stream begins");
	bind_test_fft_chain(0u);
	/* Establish the active owner without producing a frame. */
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES);
	bridge_hw_dsp_pump();

	for (uint16_t i = 0u; i < 32u; ++i)
		adc_streams[0].ring[i] = i;
	mock_dma_set_remaining(DMA0, DMA_CH0, BRIDGE_ADC_STREAM_RING_SAMPLES - 32u);
	mock_fft_set_flag(SET);

	/* Each sample takes one lease-protected capture and one protected
	 * append (64 locks); lock 65 claims the unreadable publishing token.
	 * Inject END -> BEGIN -> BIND on lock 66, immediately before the final
	 * metadata/owner commit. The callback runs from __get_PRIMASK(), before
	 * interrupts become masked, so this is a silicon-reachable boundary. */
	mock_irq_set_lock_hook(66u, replace_stream_with_fft);
	bridge_hw_dsp_pump();

	zassert_equal(replacement_end_result, BRIDGE_HW_OK, "END before publish commit succeeds");
	zassert_equal(replacement_begin_result, BRIDGE_HW_OK, "same-ID replacement begins");
	uint32_t seq   = 0xDEADBEEFu;
	uint16_t total = 0xFFFFu;
	uint8_t  got   = 0xFFu;
	float    bin   = -1.0f;
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_ERR_IO,
	              "revoked publisher cannot expose its frame through the replacement owner");
	zassert_equal(got, 0u, "no stale bins are exposed after publish revocation");
	zassert_equal(
	    adc_streams[0].pump_raw_read, 0u, "publish revocation leaves replacement cursor fresh");

	bridge_hw_dsp_pump();
	zassert_equal(bridge_hw_adc_spectrum_read(0u, 0u, 1u, &seq, &total, &got, &bin),
	              BRIDGE_HW_OK,
	              "replacement publishes its own frame on the next tick");
	zassert_equal(seq, 1u, "replacement publication starts at sequence one");
	zassert_equal(bridge_hw_adc_stream_end(0u), BRIDGE_HW_OK, "replacement stream ends cleanly");
}

ZTEST_SUITE(gd32_adc_seq, NULL, NULL, NULL, NULL, NULL);
